Repository: tuyennv216/PTMngVSIX
Catalog: PTMngVSIX/Resource/Lang/ContextMenu.*.resx
Languages: vi

# Button_C0000_Connect_Server
source: Connect to AI Server
vi: Kết nối đến AI Server

# Button_C1000_GenerateCode
source: Generate Code
vi: Tạo Code

# Button_C1001_GenerateFunction
source: Generate Function
vi: Tạo function

# Button_C1003_ReflectCode
source: Refactor Code
vi: Thay đổi code

# Button_C1005_AddComment
source: Add Comments
vi: Thêm comments

# Button_C1006_CompleteFunction
source: Complete Function
vi: Hoàn thành function

# Button_C1040_SummaryFunction
source: Generate Function Summary
vi: Tạo Summary hàm

# Button_C1050_OptimizeFunction
source: Optimize Function
vi: Tối ưu hàm

# Button_C1060_ExplainFunction
source: Explain Function
vi: Giải thích hàm

# Button_C2000_DocsSelection
source: Generate Documentation from Selection
vi: Tạo tài liệu theo vùng chọn

# Button_C2001_DocsFunction
source: Generate Function Documentation
vi: Tạo tài liệu hàm Function

# Button_C2002_DocsClass
source: Generate Class Documentation
vi: Tạo tài liệu lớp Class

# Button_C2010_DocsApi
source: Generate API Documentation
vi: Tạo tài liệu Api

# Button_C2020_DocsTechnicalSpecifications
source: Generate Technical Specification
vi: Tạo tài liệu Technical specifications

# Button_C3010_ExplainError
source: Explain Error
vi: Giải thích lỗi

# Button_C3020_SuggestFixes
source: Suggest Fix
vi: Gợi ý sửa lỗi

# Button_C4010_Whitebox
source: Generate White-box Test Cases
vi: Tạo White-box Test Cases

# Button_C4020_Blackbox_UnitTests
source: Generate Black-box Unit Test Cases
vi: Tạo Black-box Unit Test Cases

# Button_C4021_Backbox_IntegrationTests
source: Generate Black-box Integration Test Cases
vi: Tạo Black-box Integration Test Cases

# Button_C4022_Blackbox_EdgeCaseTesting
source: Generate Black-box Edge Case Test Cases
vi: Tạo Black-box Edge Case Test Cases

# Button_C4023_Blackbox_PerformanceTesting
source: Generate Black-box Performance Test Cases
vi: Tạo Black-box Performance Test Cases

# Button_C5030_SuggestSolution
source: Suggest Solution
vi: Gợi ý giải pháp

# Button_C5040_SuggestDeploy
source: Suggest Deploy
vi: Gợi ý triển khai

# Button_C5050_SuggestArchitecture
source: Suggest Architecture
vi: Gợi ý kiến trúc

# Button_C5060_SuggestTechnologies
source: Suggest Technologies
vi: Gợi ý công nghệ

# Button_C5070_SuggestFeatures
source: Suggest Features
vi: Gợi ý tính năng

# Button_C6010_AddCodeSnippet
source: Add Code Snippet
vi: Thêm code snippet

# Button_C1002_GenerateClass
source: Generate Class
vi: Tạo class

# Button_C1004_FillInMiddle
source: Auto-fill Middle Block
vi: Tự động điền Fill In Middle

# Button_C3030_FixErrorLine
source: Fix the error line
vi: Sửa dòng lỗi
